#Область ПрограммныйИнтерфейс

// Вызываемая процедура для создания реквизита "КонтактноеЛицо" на формах документов.
Процедура ДополнитьФорму(Форма) Экспорт

	Имяформы = Форма.Имяформы; 

	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда

		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);         

	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда  

		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);                            

	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда   

		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);                            

	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда  

		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 

	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 

		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма); 

	КонецЕсли;           

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создает реквизит в шапке документа под реквизитом "Договор".
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт 

	НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
    НовыйЭлемент.ПутьКДанным = "Объект.ТП_КонтактныеЛица";
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры          

// Создает реквизит на форме документа перед реквизитом "Суммадокумента".
Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) Экспорт

	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаДоговор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ТП_КонтактныеЛица";

КонецПроцедуры

#КонецОбласти